STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_smartcard.c
/**
  ******************************************************************************
  * @file    stm32g474e_eval_smartcard.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage SmartCard
  *          available on STM32G474E-EVAL board (MB1397) from
  *          STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32g474e_eval_smartcard.h"
#include "stm32g474e_eval_errno.h"
#include "stm32g474e_eval_io.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32G474E-EVAL
  * @{
  */

/** @defgroup STM32G474E-EVAL_SMARTCARD STM32G474E-EVAL SMARTCARD
  * @{
  */

/** @defgroup STM32G474E-EVAL_SMARTCARD_Private_Variables SMARTCARD Private Variables
  * @{
  */

SMARTCARD_HandleTypeDef hsmcd ={0};
SMARTCARD_ATR SMARTCARD_A2R;
uint8_t SMARTCARD_ATR_Table[40] = {0};
const uint8_t ICCID[2] = {0x2F, 0xE2};

static __IO uint8_t SMARTCARDData = 0;
static uint32_t F_Table[16] = {372, 372, 558, 744, 1116, 1488, 1860, 0,
                               0, 512, 768, 1024, 1536, 2048, 0, 0};
static uint32_t D_Table[8] = {0, 1, 2, 4, 8, 16, 32, 64};
const uint8_t ICCID_Expected[ICCID_LENGTH] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
/* APDU Transport Structures */
SMARTCARD_ADPU_Commands SMARTCARD_ADPU;
SMARTCARD_ADPU_Response SMARTCARD_Response;

/****************************/
/* USART3 interrupt numbers */
/****************************/
USART_IRQ_t USART3_IRQ =
{
  .IRQn_USART  = USART3_IRQn,
  .IRQn_DMA_rx = DMA1_Channel1_IRQn,
  .IRQn_DMA_tx = DMA1_Channel2_IRQn
};

USART_TypeDef *       SC_USART = SMARTCARD_USART;  /* as defined in the _eval_config */
USART_IRQ_t *         pSC_USART_IRQ = &USART3_IRQ;
USART_Clock_Source_t  SC_USART_CLOCK_SOURCE = USART_CLOCK_SOURCE_PCLK;

/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_SMARTCARD_Private_FunctionPrototypes SMARTCARD Private Function Prototypes
  * @{
  */
static void SMARTCARD_Init(void);
static void SMARTCARD_DeInit(void);
static void SMARTCARD_PowerCmd(uint32_t NewState);
static void SMARTCARD_Reset(uint32_t ResetState);
static void SMARTCARD_VoltageConfig(uint32_t SC_Voltage);

static void SMARTCARD_Handler(SMARTCARD_State *SMARTCARDState, SMARTCARD_ADPU_Commands *SMARTCARD_ADPU, SMARTCARD_ADPU_Response *SMARTCARD_Response);
static int32_t SMARTCARD_Config(void);
static void SMARTCARD_PTSConfig(void);
static void SMARTCARD_SendData(SMARTCARD_ADPU_Commands *SMARTCARD_ADPU, SMARTCARD_ADPU_Response *SMARTCARD_ResponseStatus);
static void SMARTCARD_AnswerReq(SMARTCARD_State *SMARTCARD_State, uint8_t *card, uint8_t length);
static uint8_t SMARTCARD_Decode_Answer2reset(uint8_t *card);
static int32_t SMARTCARD_Transmit(uint8_t *pData, uint16_t Size);
static int32_t SMARTCARD_Receive(uint8_t *pData, uint16_t Size);
static int32_t SMARTCARD_Abort(void);
static void SMARTCARD_Error(void);

/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_SMARTCARD_Private_Functions SMARTCARD Private Functions
  * @{
  */

/**
  * @brief  Initializes SMARTCARD HAL.
  * @retval BSP status
  */
int32_t BSP_SMARTCARD_Init(void)
{
  int32_t ret = BSP_ERROR_NONE;

  hsmcd.Instance = SMARTCARD_USART;
  hsmcd.Init.BaudRate = 10752;
  hsmcd.Init.WordLength = SMARTCARD_WORDLENGTH_9B;
  hsmcd.Init.StopBits = SMARTCARD_STOPBITS_1_5;
  hsmcd.Init.Parity = SMARTCARD_PARITY_EVEN;
  hsmcd.Init.Mode = SMARTCARD_MODE_TX_RX;
  hsmcd.Init.CLKPolarity = SMARTCARD_POLARITY_LOW;
  hsmcd.Init.CLKPhase = SMARTCARD_PHASE_1EDGE;
  hsmcd.Init.CLKLastBit = SMARTCARD_LASTBIT_ENABLE;
  hsmcd.Init.Prescaler = SMARTCARD_PRESCALER;
  hsmcd.Init.GuardTime = 0;
  hsmcd.Init.NACKEnable = SMARTCARD_NACK_ENABLE;
  hsmcd.Init.OneBitSampling = SMARTCARD_ONE_BIT_SAMPLE_DISABLE;
  hsmcd.Init.TimeOutEnable = SMARTCARD_TIMEOUT_DISABLE;
  hsmcd.Init.BlockLength = 0;  /* T=1 not applicable */
  hsmcd.Init.AutoRetryCount = 3;
  hsmcd.AdvancedInit.AdvFeatureInit = SMARTCARD_ADVFEATURE_NO_INIT;

  if(HAL_SMARTCARD_GetState(&hsmcd) == HAL_SMARTCARD_STATE_RESET)
  {
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0)
  /* Init the SMARTCARD */
  if (HAL_SMARTCARD_Init(&hsmcd) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
#else
  if(IsSmartCardMspCbValid == 0)
  {
    BSP_BUS_DefaultMspCallbacks(0);
  }
#endif /* (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0) */

  }
   /* Set RSTIN HIGH */
  SMARTCARD_Reset(SMARTCARD_ENABLE);
  /* Set RSTIN HIGH */
  SMARTCARD_Reset_ON();

  /* Select 5V */
  SMARTCARD_VoltageConfig(SMARTCARD_VOLTAGE_5V);
  HAL_Delay(1);

  /* Enable CMDVCC */
  SMARTCARD_PowerCmd(SMARTCARD_ENABLE);

  /* Set RSTIN LOW */
  HAL_Delay(1);
  SMARTCARD_Reset(SMARTCARD_DISABLE);

  return ret;
}

/**
  * @brief  DeInitializes SMARTCARD HAL.
  * @retval BSP status
  */
int32_t BSP_SMARTCARD_DeInit(void)
{
  /* Disable CMDVCC */
  SMARTCARD_PowerCmd(SMARTCARD_DISABLE);

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0)
  HAL_SMARTCARD_MspDeInit(&hsmcd);
#else
  IsSmartCardMspCbValid = 0;
#endif /* (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0) */

  /* Init the SMARTCARD */
  if (HAL_SMARTCARD_DeInit(&hsmcd) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  detect Smartcard presence.
  * @retval BSP_ERROR_NONE if SmartCard is present
  *         BSP_ERROR_COMPONENT_FAILURE if SmartCard is not present
  */
int32_t BSP_SMARTCARD_IsDetected(void)
{
    if ( BSP_IO_ReadPin(0,SMARTCARD_OFF) == IO_PIN_RESET )
         return BSP_ERROR_COMPONENT_FAILURE ;
    else
         return BSP_ERROR_NONE;
}

/**
  * @brief  Smartcard re-config .
  * @retval BSP_ERROR_NONE if SmartCard is re-configured
  *         BSP_ERROR_COMPONENT_FAILURE if SmartCard is not present
  */
int32_t BSP_SMARTCARD_Config(void)
{
  if (BSP_SMARTCARD_IsDetected() != BSP_ERROR_NONE)
        return BSP_ERROR_COMPONENT_FAILURE ;

  SMARTCARD_Config();
  SMARTCARD_PTSConfig();

