STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_smartcard.c
  return BSP_ERROR_NONE;
}

/**
  * @brief  sends data to the Smartcard
  * @retval BSP_ERROR_NONE if data sent correctly is present
  *         BSP_ERROR_BUSY if SmartCard is busy
  *         BSP_ERROR_COMPONENT_FAILURE if smartcard is not present
  *         BSP_ERROR_BUS_FAILURE if otherwise
  */
int32_t BSP_SMARTCARD_Send(uint8_t *pData, uint16_t Size)
{
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief  receives data from the Smartcard
  * @retval BSP_ERROR_NONE if data sent correctly is present
  *         BSP_ERROR_BUSY if SmartCard is busy
  *         BSP_ERROR_COMPONENT_FAILURE if smartcard is not present
  *         BSP_ERROR_BUS_FAILURE if otherwise
  */
int32_t BSP_SMARTCARD_Recv(uint8_t *pData, uint16_t Size)
{
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief  abort operation on Smartcard
  * @retval BSP_ERROR_NONE if data sent correctly is present
  *         BSP_ERROR_BUSY if SmartCard is busy
  *         BSP_ERROR_COMPONENT_FAILURE if smartcard is not present
  *         BSP_ERROR_BUS_FAILURE if otherwise
  */
int32_t BSP_SMARTCARD_Abort(void)
{

  return SMARTCARD_Abort();
}
/**
  * @brief  Init the SMARTCARD MSP
  * @retval None
  */
void HAL_SMARTCARD_MspInit(SMARTCARD_HandleTypeDef *hsmartcard)
{
    GPIO_InitTypeDef  GPIO_InitStruct;
    RCC_PeriphCLKInitTypeDef USART_clock_source_config, SMARTCARD_clock_source_config;

    __HAL_RCC_USART3_CLK_ENABLE();

    /* periph clock configuration */
    USART_clock_source_config.PeriphClockSelection = RCC_PERIPHCLK_USART3;
    USART_clock_source_config.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
    HAL_RCCEx_PeriphCLKConfig(&USART_clock_source_config);

    /* set SMARTCARD and clock on */
    SMARTCARD_CLK_GPIO_CLK_ENABLE();
    /* Configure USART CK as alternate function  */
    GPIO_InitStruct.Pin   = SMARTCARD_CLK_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
    HAL_GPIO_Init(SMARTCARD_CLK_GPIO_PORT, &GPIO_InitStruct);

    /* By default, turn on */
    HAL_GPIO_WritePin(SMARTCARD_CLK_GPIO_PORT, SMARTCARD_CLK_PIN, GPIO_PIN_SET);

    SMARTCARD_IO_GPIO_CLK_ENABLE();
    /* Configure USART Tx (IO) pin as alternate function open-drain */
    GPIO_InitStruct.Pin   = SMARTCARD_IO_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
    HAL_GPIO_Init(SMARTCARD_IO_GPIO_PORT, &GPIO_InitStruct);

    /* By default, turn on */
    HAL_GPIO_WritePin(SMARTCARD_IO_GPIO_PORT, SMARTCARD_IO_PIN, GPIO_PIN_SET);

    /* power-on 1V8 and 3/5V supplies, OFF, RST and CMDVCC signals */
#if defined(USE_IOEXPANDER)
  /* On eval board, SmartCard OFF, RST, 1V8, 3/5V, CMDVCC connected to MFX */
  BSP_IO_Init_t io_init_structure;

  /* Initialize the IO functionalities */
  io_init_structure.Pin  = (SMARTCARD_1V8 | SMARTCARD_3_5V | SMARTCARD_OFF |SMARTCARD_CMDVCC  | SMARTCARD_RST);
  io_init_structure.Pull = IO_PULLUP;
  io_init_structure.Mode = IO_MODE_OUTPUT_OD;
  /* Initialize IO */
  if(BSP_IO_Init(0, &io_init_structure) == BSP_ERROR_NONE)
  {
     BSP_IO_WritePin(0,(SMARTCARD_1V8 | SMARTCARD_3_5V | SMARTCARD_OFF |SMARTCARD_CMDVCC  | SMARTCARD_RST), IO_PIN_SET);
  }
#endif  /* USE_IOEXPANDER */

 /* periph clock configuration */
 SMARTCARD_clock_source_config.Usart3ClockSelection = RCC_USART3CLKSOURCE_HSI;
 SMARTCARD_clock_source_config.PeriphClockSelection = RCC_PERIPHCLK_USART3;
 HAL_RCCEx_PeriphCLKConfig(&SMARTCARD_clock_source_config);

}

/**
  * @brief  DeInit the SMARTCARD MSP
  * @retval None
  */
void HAL_SMARTCARD_MspDeInit(SMARTCARD_HandleTypeDef *hsmartcard)
{

  SMARTCARD_CLK_GPIO_CLK_DISABLE();
  SMARTCARD_IO_GPIO_CLK_DISABLE();

 #if defined(USE_IOEXPANDER)
  /* On eval board, SmartCard OFF, RST, 1V8, 3/5V, CMDVCC connected to MFX */
  BSP_IO_Init_t io_init_structure;

     io_init_structure.Pin  = (SMARTCARD_1V8 | SMARTCARD_3_5V | SMARTCARD_OFF |SMARTCARD_CMDVCC  | SMARTCARD_RST);
     io_init_structure.Pull = IO_PULLUP;
     io_init_structure.Mode = IO_MODE_OFF;

      BSP_IO_Init(0, &io_init_structure);
  /* do not DeInitialize MFX as it is used by other parts */
#endif  /* USE_IOEXPANDER */

}


/**
  * @brief  Initializes all peripheral used for Smartcard interface.
  * @param  None
  * @retval None
  */
static void SMARTCARD_Init(void)
{

  /* SC_USART configuration --------------------------------------------------*/
  /* SC_USART configured as follow:
  - Word Length = 9 Bits
  - 1.5 Stop Bit
  - Even parity
  - BaudRate = 10752 baud
  - Hardware flow control disabled (RTS and CTS signals)
  - Tx and Rx enabled
  - USART Clock enabled
  */
  hsmcd.Instance = SMARTCARD_USART;
  hsmcd.Init.BaudRate = 10752;   /* Starting baudrate = 4MHz / 372etu */
  hsmcd.Init.WordLength = SMARTCARD_WORDLENGTH_9B; /* Not configurable: 8 bits plus parity */
  hsmcd.Init.StopBits = SMARTCARD_STOPBITS_1_5;    /* Not configurable: 1.5 stop bits */
  hsmcd.Init.Parity = SMARTCARD_PARITY_EVEN;
  hsmcd.Init.Mode = SMARTCARD_MODE_TX_RX;
  hsmcd.Init.CLKPolarity = SMARTCARD_POLARITY_LOW;
  hsmcd.Init.CLKPhase = SMARTCARD_PHASE_1EDGE;
  hsmcd.Init.CLKLastBit = SMARTCARD_LASTBIT_ENABLE;
  hsmcd.Init.Prescaler = SMARTCARD_PRESCALER;
  hsmcd.Init.GuardTime = 0;
  hsmcd.Init.NACKEnable = SMARTCARD_NACK_ENABLE;
  hsmcd.Init.OneBitSampling = SMARTCARD_ONE_BIT_SAMPLE_DISABLE;
  hsmcd.Init.TimeOutEnable = SMARTCARD_TIMEOUT_DISABLE;
  hsmcd.Init.BlockLength = 0;  /* T=1 not applicable */
  hsmcd.Init.AutoRetryCount = 3;
  hsmcd.AdvancedInit.AdvFeatureInit = SMARTCARD_ADVFEATURE_NO_INIT;

  if(HAL_SMARTCARD_GetState(&hsmcd) == HAL_SMARTCARD_STATE_RESET)
  {
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0)
    /* Init the SMARTCARD */
    if (HAL_SMARTCARD_Init(&hsmcd) != HAL_OK)
    {
         SMARTCARD_Error();
    }
#else
    if(IsSmartCardMspCbValid == 0)
    {
      BSP_BUS_DefaultMspCallbacks(0);
    }
#endif /* (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0) */
  }
}

/**
  * @brief  DeInitializes all peripheral used for Smartcard interface.
  * @param  None
  * @retval None
  */
static void SMARTCARD_DeInit(void)
{
  /* Disable CMDVCC */
  SMARTCARD_PowerCmd(SMARTCARD_DISABLE);

