STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_smartcard.c
  /* Deinitializes the hsmcd */
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0)
  HAL_SMARTCARD_MspDeInit(&hsmcd);
#else
  IsSmartCardMspCbValid = 0;
#endif /* (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 0) */

  /* Init the SMARTCARD */
  if (HAL_SMARTCARD_DeInit(&hsmcd) != HAL_OK)
  {
         SMARTCARD_Error();
  }
}

/**
* @brief  infinite loop in case of error.
* @param  None
* @retval None
*/
static void SMARTCARD_Error(void)
{
  while(1);
}

/**
* @brief  Enables or disables the power to the Smartcard.
* @param  NewState: new state of the Smartcard power supply.
*         This parameter can be: SMARTCARD_ENABLE or SMARTCARD_DISABLE.
* @retval None
*/
static void SMARTCARD_PowerCmd(uint32_t NewState)
{
    BSP_IO_WritePin(0,SMARTCARD_CMDVCC, (NewState!= SMARTCARD_DISABLE)?IO_PIN_RESET:IO_PIN_SET);
}

/**
  * @brief  Sets or clears the Smartcard reset pin.
  * @param  ResetState: this parameter specifies the state of the Smartcard
  *         reset pin.
  *                 @arg SMARTCARD_ENABLE: to reset the Smartcard.
  *                 @arg SMARTCARD_DISABLE: to un-reset the Smartcard.
  * @retval None
  */
static void SMARTCARD_Reset(uint32_t ResetState)
{
    /* RST active high */
    BSP_IO_WritePin(0,SMARTCARD_RST, (ResetState == IO_PIN_SET)?IO_PIN_SET:IO_PIN_RESET);
}

/**
  * @brief  Configures the card power voltage.
  * @param  SMARTCARD_Voltage: specifies the card power voltage.
  *         This parameter can be one of the following values:
  *              @arg SMARTCARD_VOLTAGE_5V: 5V cards.
  *              @arg SMARTCARD_VOLTAGE_3V: 3V cards.
  * @retval None
  */
static void SMARTCARD_VoltageConfig(uint32_t SMARTCARD_Voltage)
{
  if(SMARTCARD_Voltage == SMARTCARD_VOLTAGE_5V)
  {
    /* Select Smartcard 5V */
    BSP_IO_WritePin(0,SMARTCARD_3_5V, IO_PIN_SET);
  }
  else
  {
    /* Select Smartcard 3V */
    BSP_IO_WritePin(0,SMARTCARD_3_5V, IO_PIN_RESET);
  }
}

/**
  * @brief  Configures the Smartcard.
  * @retval None.
  */
static int32_t SMARTCARD_Config(void)
{
  uint32_t i=0;

  /* Configure Card slot access */
  SMARTCARD_State SMARTCARDState = SMARTCARD_POWER_OFF;

  /* Wait A2R --------------------------------------------------------------*/
  SMARTCARDState = SMARTCARD_POWER_ON;

  SMARTCARD_ADPU.Header.CLA = 0x00;
  SMARTCARD_ADPU.Header.INS = SMARTCARD_GET_A2R;
  SMARTCARD_ADPU.Header.P1 = 0x00;
  SMARTCARD_ADPU.Header.P2 = 0x00;
  SMARTCARD_ADPU.Body.LC = 0x00;

  /* Power on card */
  while(SMARTCARDState != SMARTCARD_ACTIVE_ON_T0)
  {
    SMARTCARD_Handler(&SMARTCARDState, &SMARTCARD_ADPU, &SMARTCARD_Response);
  }

  /* Wait a little after ATR message reception */
  HAL_Delay(100);

  /* Apply the Procedure Type Selection (PTS) */
  SMARTCARD_PTSConfig();

  /* Select MF -------------------------------------------------------------*/
  SMARTCARD_ADPU.Header.CLA = SMARTCARD_CLA_GSM11;
  SMARTCARD_ADPU.Header.INS = SMARTCARD_SELECT_FILE;
  SMARTCARD_ADPU.Header.P1 = 0x00;
  SMARTCARD_ADPU.Header.P2 = 0x00;
  SMARTCARD_ADPU.Body.LC = 0x02;

  /* Select ICCID ----------------------------------------------------------*/
  {
    /* Send APDU Command for ICCID selection */
    SMARTCARD_ADPU.Header.CLA = SMARTCARD_CLA_GSM11;
    SMARTCARD_ADPU.Header.INS = SMARTCARD_SELECT_FILE;
    SMARTCARD_ADPU.Header.P1 = 0x00;
    SMARTCARD_ADPU.Header.P2 = 0x00;
    SMARTCARD_ADPU.Body.LC = 0x02/*0x22*/;

    for(i = 0; i < SMARTCARD_ADPU.Body.LC; i++)
    {
      SMARTCARD_ADPU.Body.Data[i] = ICCID[i];
    }
    while(i < LC_MAX)
    {
      SMARTCARD_ADPU.Body.Data[i++] = 0;
    }
    SMARTCARD_ADPU.Body.LE = 0;

    SMARTCARD_Handler(&SMARTCARDState, &SMARTCARD_ADPU, &SMARTCARD_Response);
  }

  /* Read Binary in ICCID --------------------------------------------------*/
  if(SMARTCARD_Response.SW1 == SMARTCARD_EF_SELECTED)
  {
    SMARTCARD_ADPU.Header.CLA = SMARTCARD_CLA_GSM11;
    SMARTCARD_ADPU.Header.INS = SMARTCARD_READ_BINARY;
    SMARTCARD_ADPU.Header.P1 = 0x00;
    SMARTCARD_ADPU.Header.P2 = 0x00;
    SMARTCARD_ADPU.Body.LC = 0x00;

    SMARTCARD_ADPU.Body.LE = 10;

    SMARTCARD_Handler(&SMARTCARDState, &SMARTCARD_ADPU, &SMARTCARD_Response);
  }
  else
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Check value of read ICCID */
  for (i=0; i<ICCID_LENGTH; i++)
  {
    if(SMARTCARD_Response.Data[i] != ICCID_Expected[i])
    {
      return BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  Configures the IO speed (BaudRate) communication.
  * @retval None
  */
void SMARTCARD_PTSConfig(void)
{
  uint32_t workingbaudrate = 0, apbclock = 0;
  uint8_t  PPSConfirmStatus = 1;
  uint8_t  SMARTCARD_PPSS[4] = {0};

  /* Reconfigure the USART Baud Rate -----------------------------------------*/
  apbclock = HAL_RCC_GetPCLK1Freq();
  apbclock /= ((SMARTCARD_USART->GTPR & (uint16_t)0x00FF) * 2);

  if((SMARTCARD_A2R.T0 & (uint8_t)0x10) == 0x10)
  {
    if(SMARTCARD_A2R.T[0] != 0x11)
    {
      /* PPSS identifies the PPS request or responce and is equal to 0xFF */
      SMARTCARD_PPSS[0] = 0xFF;
      /* PPS0 indicates by the bits b5, b6, b7 equal to 1 the presence of the optional
      bytes PPSI1, PPS2, PPS3 respectively */
      SMARTCARD_PPSS[1] = 0x10;   /* only send PPS1 */
      /* PPS1 allows the interface device to propose value of F and D to the card */
      SMARTCARD_PPSS[2] = SMARTCARD_A2R.T[0];
      /* PCK check character */
      SMARTCARD_PPSS[3] = (uint8_t)0xFF^(uint8_t)0x10^(uint8_t)SMARTCARD_A2R.T[0];

      if(SMARTCARD_Transmit((uint8_t *)SMARTCARD_PPSS, 4) != BSP_ERROR_NONE)
      {
         SMARTCARD_Error();
      }
#if 0
      uint8_t locData = 0;
      /* PPSS response = PPSS request = 0xFF*/
      if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
      {
        if(locData != 0xFF)
        {
          /*PPSS exchange unsuccessful */
          PPSConfirmStatus = 0x00;
        }

        /*PPS0 response */
        if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
        {
          if(locData != 0x10)
          {
            /*PPS0 exchange unsuccessful */
            PPSConfirmStatus = 0x00;
          }
        }
        else
        {
          Error_Handler();
        }
        /*PPS1 response */
        if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
        {
          if(locData != SMARTCARD_A2R.T[0])
          {
            /*PPS1 exchange unsuccessful */
            PPSConfirmStatus = 0x00;
          }
        }
        else
        {
          Error_Handler();
        }
        /*PCK response */
        if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
        {
          if(locData != ((uint8_t)0xFF^(uint8_t)0x10^(uint8_t)SMARTCARD_A2R.T[0]))
          {
            /*PCK exchange unsuccessful */
            PPSConfirmStatus = 0x00;
          }
        }
        else
        {
          Error_Handler();
        }
      }
      else
      {
        /*PPSS exchange unsuccessful */
        PPSConfirmStatus = 0x00;
      }
#else
      if(SMARTCARD_Receive(SMARTCARD_PPSS, 4) == BSP_ERROR_NONE)
      {
        if((SMARTCARD_PPSS[0] != 0xFF) ||
           (SMARTCARD_PPSS[1] != 0x10) ||
           (SMARTCARD_PPSS[2] != SMARTCARD_A2R.T[0]) ||
           (SMARTCARD_PPSS[3] != ((uint8_t)0xFF^(uint8_t)0x10^(uint8_t)SMARTCARD_A2R.T[0])))
        {
          /*PCK exchange unsuccessful */
          PPSConfirmStatus = 0x00;
        }
      }
      else
      {
        /*PPSS exchange unsuccessful */
        PPSConfirmStatus = 0x00;
      }
#endif

