STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_smartcard.c
      /* PPS exchange successful */
      if(PPSConfirmStatus == 0x01)
      {
        workingbaudrate = apbclock * D_Table[(SMARTCARD_A2R.T[0] & (uint8_t)0x0F)];
        workingbaudrate /= F_Table[((SMARTCARD_A2R.T[0] >> 4) & (uint8_t)0x0F)];

        //hsmcd.Instance = SMARTCARD_USART;
        hsmcd.Init.BaudRate = workingbaudrate;
        //hsmcd.Init.WordLength = SMARTCARD_WORDLENGTH_9B;
        //hsmcd.Init.StopBits = SMARTCARD_STOPBITS_1_5;
        //hsmcd.Init.Parity = SMARTCARD_PARITY_EVEN;
        //hsmcd.Init.Mode = SMARTCARD_MODE_TX_RX;
        //hsmcd.Init.CLKPolarity = SMARTCARD_POLARITY_LOW;
        //hsmcd.Init.CLKPhase = SMARTCARD_PHASE_1EDGE;
        //hsmcd.Init.CLKLastBit = SMARTCARD_LASTBIT_ENABLE;
        //hsmcd.Init.Prescaler = 10;
        //hsmcd.Init.GuardTime = 0;
        //hsmcd.Init.NACKEnable = SMARTCARD_NACK_ENABLE;
        //hsmcd.Init.OneBitSampling = SMARTCARD_ONE_BIT_SAMPLE_ENABLE;
        //hsmcd.Init.TimeOutEnable = SMARTCARD_TIMEOUT_DISABLE;
        //hsmcd.Init.BlockLength = 0;  /* T=1 not applicable */
        //hsmcd.Init.AutoRetryCount = 3;
        //hsmcd.AdvancedInit.AdvFeatureInit = SMARTCARD_ADVFEATURE_NO_INIT;
        if(HAL_SMARTCARD_Init(&hsmcd) != HAL_OK)
        {
          SMARTCARD_Error();
        }
      }
    }
  }
}

/**
  * @brief  Manages the Smartcard transport layer: send APDU commands and receives
  *         the APDU response.
  * @param  SMARTCARD_ADPU: pointer to a SMARTCARD_ADPU_Commands structure which will be initialized.
  * @param  SMARTCARD_ResponseStatus: pointer to a SMARTCARD_ADPU_Response structure which will be initialized.
  * @retval None
  */
static void SMARTCARD_SendData(SMARTCARD_ADPU_Commands *SMARTCARD_ADPU, SMARTCARD_ADPU_Response *SMARTCARD_ResponseStatus)
{
  uint32_t i = 0;
  uint8_t SMARTCARD_Command[5] = {0};
  uint8_t locData = 0;

  /* Reset responce buffer ---------------------------------------------------*/
  for(i = 0; i < LC_MAX; i++)
  {
    SMARTCARD_ResponseStatus->Data[i] = 0;
  }

  SMARTCARD_ResponseStatus->SW1 = 0;
  SMARTCARD_ResponseStatus->SW2 = 0;

  /* Send header -------------------------------------------------------------*/
  SMARTCARD_Command[0] = SMARTCARD_ADPU->Header.CLA;
  SMARTCARD_Command[1] = SMARTCARD_ADPU->Header.INS;
  SMARTCARD_Command[2] = SMARTCARD_ADPU->Header.P1;
  SMARTCARD_Command[3] = SMARTCARD_ADPU->Header.P2;
  if(SMARTCARD_ADPU->Body.LC)
  {
    SMARTCARD_Command[4] = SMARTCARD_ADPU->Body.LC;
  }
  else
  {
    SMARTCARD_Command[4] = SMARTCARD_ADPU->Body.LE;
  }

  if(SMARTCARD_Transmit((uint8_t *)SMARTCARD_Command, 5) != BSP_ERROR_NONE)
  {
    SMARTCARD_Error();
  }

  /* --------------------------------------------------------
    Wait Procedure byte from card:
    1 - ACK
    2 - NULL
    3 - SW1; SW2
   -------------------------------------------------------- */
  if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
  {
    if(((locData & (uint8_t)0xF0) == 0x60) || ((locData & (uint8_t)0xF0) == 0x90))
    {
      /* SW1 received */
      SMARTCARD_ResponseStatus->SW1 = locData;

      if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
      {
        /* SW2 received */
        SMARTCARD_ResponseStatus->SW2 = locData;
      }
    }
    else if (((locData & (uint8_t)0xFE) == (((uint8_t)~(SMARTCARD_ADPU->Header.INS)) & \
             (uint8_t)0xFE))||((locData & (uint8_t)0xFE) == (SMARTCARD_ADPU->Header.INS & (uint8_t)0xFE)))
    {
      SMARTCARD_ResponseStatus->Data[0] = locData;/* ACK received */
    }
  }
  else
  {
    SMARTCARD_Error();
  }

  /* If no status bytes received ---------------------------------------------*/
  if(SMARTCARD_ResponseStatus->SW1 == 0x00)
  {
    /* Send body data to SMARTCARD   -----------------------------------------*/
    if (SMARTCARD_ADPU->Body.LC)
    {
      if(SMARTCARD_Transmit((uint8_t *)SMARTCARD_ADPU->Body.Data, SMARTCARD_ADPU->Body.LC) != BSP_ERROR_NONE)
      {
        SMARTCARD_Error();
      }
    }

    /* Or receive body data from SMARTCARD  ----------------------------------*/
    else if (SMARTCARD_ADPU->Body.LE)
    {
      for(i = 0; i < SMARTCARD_ADPU->Body.LE; i++)
      {
        if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
        {
          SMARTCARD_ResponseStatus->Data[i] = locData;
        }
        else
        {
          SMARTCARD_Error();
        }
      }
    }
    /* Wait SW1 --------------------------------------------------------------*/
    if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
    {
      SMARTCARD_ResponseStatus->SW1 = locData;
    }
    else
    {
      SMARTCARD_Error();
    }
    /* Wait SW2 --------------------------------------------------------------*/
    if(SMARTCARD_Receive((uint8_t *)&locData, 1) == BSP_ERROR_NONE)
    {
      SMARTCARD_ResponseStatus->SW2 = locData;
    }
    else
    {
      SMARTCARD_Error();
    }
  }
}

/**
  * @brief  Requests the reset answer from card.
  * @param  SMARTCARD_State: pointer to an SC_State enumeration that will contain the Smartcard state.
  * @param  card: pointer to a buffer which will contain the card ATR.
  * @param  length: maximum ATR length
  * @retval None
  */
static void SMARTCARD_AnswerReq(SMARTCARD_State *SMARTCARD_State, uint8_t *card, uint8_t length)
{
  switch(*SMARTCARD_State)
  {
  case SMARTCARD_RESET_LOW:
    /* Check responce with reset low -----------------------------------------*/
    SMARTCARD_Receive(card, length);

    if(card[0] != 0x00)
    {
      (*SMARTCARD_State) = SMARTCARD_ACTIVE;
      //SC_Reset(IO_PIN_SET);
    }
    else
    {
      (*SMARTCARD_State) = SMARTCARD_RESET_HIGH;
    }
    break;

  case SMARTCARD_RESET_HIGH:
    /* Check response with reset high ----------------------------------------*/
    SMARTCARD_Reset(SMARTCARD_ENABLE); /* Reset High */

    SMARTCARD_Receive(card, length);

    if(card[0])
    {
      (*SMARTCARD_State) = SMARTCARD_ACTIVE;
    }
    else
    {
      (*SMARTCARD_State) = SMARTCARD_POWER_OFF;
    }
    break;

  case SMARTCARD_ACTIVE:
    break;

  case SMARTCARD_POWER_OFF:
    /* Close Connection if no answer received --------------------------------*/
    SMARTCARD_Reset(IO_PIN_SET); /* Reset high - a bit is used as level shifter from 3.3 to 5 V */
    SMARTCARD_PowerCmd(SMARTCARD_DISABLE);
    break;

  default:
    (*SMARTCARD_State) = SMARTCARD_RESET_LOW;
    break;
  }
}

/**
  * @brief  Decodes the Answer to reset received from card.
  * @param  card: pointer to the buffer containing the card ATR.
  * @retval None
  */
static uint8_t SMARTCARD_Decode_Answer2reset(uint8_t *card)
{
 uint32_t i = 0, flag = 0, buf = 0, protocol = 0;

