STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_smartcard.c
  SMARTCARD_A2R.TS = card[0];  /* Initial character */
  SMARTCARD_A2R.T0 = card[1];  /* Format character */

  SMARTCARD_A2R.Hlength = SMARTCARD_A2R.T0 & (uint8_t)0x0F;

  if ((SMARTCARD_A2R.T0 & (uint8_t)0x80) == 0x80)
  {
    flag = 1;
  }

  for (i = 0; i < 4; i++)
  {
    SMARTCARD_A2R.Tlength = SMARTCARD_A2R.Tlength + (((SMARTCARD_A2R.T0 & (uint8_t)0xF0) >> (4 + i)) & (uint8_t)0x1);
  }

  for (i = 0; i < SMARTCARD_A2R.Tlength; i++)
  {
    SMARTCARD_A2R.T[i] = card[i + 2];
  }

  protocol = SMARTCARD_A2R.T[SMARTCARD_A2R.Tlength - 1] & (uint8_t)0x0F;

  while (flag)
  {
    if ((SMARTCARD_A2R.T[SMARTCARD_A2R.Tlength - 1] & (uint8_t)0x80) == 0x80)
    {
      flag = 1;
    }
    else
    {
      flag = 0;
    }

    buf = SMARTCARD_A2R.Tlength;
    SMARTCARD_A2R.Tlength = 0;

    for (i = 0; i < 4; i++)
    {
      SMARTCARD_A2R.Tlength = SMARTCARD_A2R.Tlength + (((SMARTCARD_A2R.T[buf - 1] & (uint8_t)0xF0) >> (4 + i)) & (uint8_t)0x1);
    }

    for (i = 0;i < SMARTCARD_A2R.Tlength; i++)
    {
      SMARTCARD_A2R.T[buf + i] = card[i + 2 + buf];
    }
    SMARTCARD_A2R.Tlength += (uint8_t)buf;
  }

  for (i = 0; i < SMARTCARD_A2R.Hlength; i++)
  {
    SMARTCARD_A2R.H[i] = card[i + 2 + SMARTCARD_A2R.Tlength];
  }

  return (uint8_t)protocol;
}

/**
  * @brief  Handles all Smartcard states and serves to send and receive all
  *         communication data between Smartcard and reader.
  * @param  SMARTCARDState: pointer to an SMARTCARD_State enumeration that will contain the
  *         Smartcard state.
  * @param  SMARTCARD_ADPU: pointer to an SMARTCARD_ADPU_Commands structure that will be initialized.
  * @param  SMARTCARD_Response: pointer to a SMARTCARD_ADPU_Response structure which will be initialized.
  * @retval None
  */
void SMARTCARD_Handler(SMARTCARD_State *SMARTCARDState, SMARTCARD_ADPU_Commands *SMARTCARD_ADPU, SMARTCARD_ADPU_Response *SMARTCARD_Response)
{
    uint32_t i = 0;
  switch(*SMARTCARDState)
  {
  case SMARTCARD_POWER_ON:
    if (SMARTCARD_ADPU->Header.INS == SMARTCARD_GET_A2R)
    {
      /* Smartcard intialization ---------------------------------------------*/
      BSP_SMARTCARD_Init();

      /* Reset Data from SMARTCARD buffer -------------------------------------------*/
      for (i = 0; i < 40; i++)
      {
        SMARTCARD_ATR_Table[i] = 0;
      }

      /* Reset SMARTCARD_A2R Structure ----------------------------------------------*/
      SMARTCARD_A2R.TS = 0;
      SMARTCARD_A2R.T0 = 0;
      for (i = 0; i < SETUP_LENGTH; i++)
      {
        SMARTCARD_A2R.T[i] = 0;
      }
      for (i = 0; i < HIST_LENGTH; i++)
      {
        SMARTCARD_A2R.H[i] = 0;
      }
      SMARTCARD_A2R.Tlength = 0;
      SMARTCARD_A2R.Hlength = 0;

      /* Next State ----------------------------------------------------------*/
      *SMARTCARDState = SMARTCARD_RESET_LOW;
    }
    break;

  case SMARTCARD_RESET_LOW:
    if(SMARTCARD_ADPU->Header.INS == SMARTCARD_GET_A2R)
    {
      /* If card is detected then Power ON, Card Reset and wait for an answer) */
      if (BSP_IO_ReadPin(0,SMARTCARD_OFF) != IO_PIN_RESET)
      {
        while(((*SMARTCARDState) != SMARTCARD_POWER_OFF) && ((*SMARTCARDState) != SMARTCARD_ACTIVE))
        {
          SMARTCARD_AnswerReq(SMARTCARDState, (uint8_t *)&SMARTCARD_ATR_Table, 40); /* Check for answer to reset */
        }
      }
      else
      {
        (*SMARTCARDState) = SMARTCARD_POWER_OFF;
      }
    }
    break;

  case SMARTCARD_ACTIVE:
    if (SMARTCARD_ADPU->Header.INS == SMARTCARD_GET_A2R)
    {
      if(SMARTCARD_Decode_Answer2reset(&SMARTCARD_ATR_Table[0]) == T0_PROTOCOL)
      {
        (*SMARTCARDState) = SMARTCARD_ACTIVE_ON_T0;
      }
      else
      {
        (*SMARTCARDState) = SMARTCARD_POWER_OFF;
      }
    }
    break;

  case SMARTCARD_ACTIVE_ON_T0:
    SMARTCARD_SendData(SMARTCARD_ADPU, SMARTCARD_Response);
    break;

  case SMARTCARD_POWER_OFF:
    /* Disable Smartcard interface */
    /* Disable CMDVCC */
    SMARTCARD_PowerCmd(SMARTCARD_DISABLE);

    /* Deinitializes the hsmcd */
    BSP_SMARTCARD_DeInit();
    break;

  default: (*SMARTCARDState) = SMARTCARD_POWER_OFF;
  }
}


/**
  * @brief  Receive data SMARTCARD HAL.
  * @retval None
  */
int32_t SMARTCARD_Receive(uint8_t *pData, uint16_t Size)
{
 /* receive using polling mode */
 if(HAL_SMARTCARD_GetState(&hsmcd) == HAL_SMARTCARD_STATE_READY)
 {
  if ( HAL_SMARTCARD_Receive(&hsmcd, pData, Size, SMARTCARD_TIMEOUT) == HAL_OK)
    return BSP_ERROR_NONE;
  else
    return BSP_ERROR_PERIPH_FAILURE;
  }
 else
 {
  return BSP_ERROR_BUSY;
 }
}

/**
  * @brief  Transmit data SMARTCARD HAL.
  * @retval None
  */
int32_t SMARTCARD_Transmit(uint8_t *pData, uint16_t Size)
{
 /* transmit using polling mode */
 if(HAL_SMARTCARD_GetState(&hsmcd) == HAL_SMARTCARD_STATE_READY)
 {
  if ( HAL_SMARTCARD_Transmit(&hsmcd, pData, Size, SMARTCARD_TIMEOUT) == HAL_OK)
    return BSP_ERROR_NONE;
  else
    return BSP_ERROR_PERIPH_FAILURE;
  }
 else
 {
  return BSP_ERROR_BUSY;
 }
}

/**
  * @brief  Abort the operation SMARTCARD HAL.
  * @retval None
  */
int32_t SMARTCARD_Abort(void)
{
    if ( HAL_SMARTCARD_Abort(&hsmcd) == HAL_OK)
         return BSP_ERROR_NONE;
    else
         return BSP_ERROR_PERIPH_FAILURE;
}

/**
  * @}
  */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
